README.org
# -*- eval: (tangle-init-org-file-after-save); -*-

#+TITLE: Emacs configuration file
#+AUTHOR: Nicolas Bertrand
#+STARTUP: showeverything
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes

* About
** Foreword

   2018-10-12, I declare .emacs.d bankruptcy.

   My current configuration used to rely on [[https://github.com/cask/cask][Cask]] and [[https://github.com/rdallasgray/pallet][Pallet]] but it
   didn't work anymore after upgrading to Emacs 26. I lived with a
   broken config for some months but it started becoming a real problem
   once I had to go through some config overhaul to accomodate sudden
   needs.

   Another point of pain was how I handled my bindings, especially for
   *Evil* where I had some custom text-object and thus corresponding
   motions. It's been almost a year that I want to try out [[https://github.com/noctuid/general.el][general]]
   alongside [[https://github.com/justbur/emacs-which-key][which-key]] to have a nice experience ala *Magit*,
   *Spacemacs*, *Doom*... etc.

   So, why not use *Spacemacs* or *Doom* directly? Well first, this is
   the occasion for me to learn more of *org-mode* (which I only
   scratched the surface of) and improves my *emacs-lisp*.

   After seeing so many people using org-mode to write their
   configuration with great success, why not do it myself?

   Anyway, I hope this attempt at a clean config won't end in
   bankruptcy this time...

** Aim

   * Keep it fast (at first, aim for less than 0.5s at startup)
   * Don't let it rot
   * Have a little bit of documentation so that I understand some of
     my choices afterwards

** License

   This configuration is licensed under the MIT license. See provided [[https://github.com/tampix/.emacs.d/blob/master/LICENSE][LICENSE]].

* Early init

  Take advantage on Emacs 27+ *early-init* file.

  Configure GC so it doesn't run during the init. This will be
  handled later in the init by GCMH.

  #+BEGIN_SRC emacs-lisp :tangle "early-init.el"
    (setq gc-cons-threshold most-positive-fixnum)
  #+END_SRC

  Disable menus and stuff. Calls to *tool-bar-mode* and
  *scroll-bar-mode* takes roughtly 100ms each, so disable those in
  =early-init.el=.

  #+BEGIN_SRC emacs-lisp :tangle "early-init.el"
    (push '(tool-bar-lines . 0) default-frame-alist)
    (push '(menu-bar-lines . 0) default-frame-alist)
    (push '(vertical-scroll-bars) default-frame-alist)
  #+END_SRC

  Backport stuff from emacs 28.1 if needed.

  #+BEGIN_SRC emacs-lisp :tangle "early-init.el"
    ;; backport features of emacs 28.1
    (when (and (<= emacs-major-version 28)
               (< emacs-minor-version 1))
      (defmacro with-environment-variables (variables &rest body)
        (declare (indent 1))
        `(let (process-environment (copy-sequence process-environment))
           ,@(mapcar (lambda (e)
                       `(setenv ,(car e) ,(cadr e)))
                     variables)
           ,@body))

      (defun string-replace (from-string to-string in-string)
        (replace-regexp-in-string
         (regexp-quote from-string) to-string in-string t t))

      (defun string-search (needle haystack &optional start-pos)
        (string-match-p (regexp-quote needle) haystack start-pos))

      (defun length= (sequence len)
        (and (>= len 0)
             (= (length sequence) len)))

      (defun length> (sequence len)
        (> (length sequence) len))

      (defun length< (sequence len)
        (< (length sequence) len)))
  #+END_SRC

* Bootstrapping

  First, let's ensure generated =init.el= has proper scoping and
  encoding.

  #+BEGIN_SRC emacs-lisp
     ;;; -*- lexical-binding: t -*-
     ;;; -*- coding: utf-8 -*-
  #+END_SRC

  Original =init.el= defines the way to reload the configuration.

  #+NAME: init
  #+BEGIN_SRC emacs-lisp
    (require 'subr-x)

    (defun in-emacs-dir (file)
      "Return the absolute path to FILE in `user-emacs-directory'."
      (file-truename (expand-file-name file user-emacs-directory)))

    (defvar tangle-init-org-file--first-time
      (not (file-exists-p (in-emacs-dir "init.elc")))
      "t if no init.elc exists.")

    (defun tangle-init-org-file (&optional no-compile)
      "Tangle, `byte-compile' and load the init file from README.org.

    With a prefix-argument, or a not-nil NO-COMPILE argument if
    called non-interactively, don't compile the tangled file.

    Return the absolute path to the tangle file if either NO-COMPILE
    is nil or `debug-on-error' is not-nil, else return nil."
      (interactive "P")
      (unless (boundp 'org-babel-tangle-file)
        (require 'ob-tangle))
      ;; For some reason, I can't make `org-babel-load-file' create the
      ;; .elc file during the first init, so for now, stick to manual
      ;; tangle -> compile -> load.
      (let ((tangled (thread-last
                       ;; car isn't always default tangled file when there
                       ;; are multiple tangled files
                       (org-babel-tangle-file (in-emacs-dir "README.org")
                                              nil
                                              "emacs-lisp")
                       (member (in-emacs-dir "README.el"))
                       car)))
        ;; When first loading the config, load the tangled file anyway to
        ;; ensure that packages are setup.
        (when tangle-init-org-file--first-time
          (load-file tangled))
        (if no-compile
            tangled
          (byte-compile-file tangled)
          (rename-file (byte-compile-dest-file tangled)
                       (in-emacs-dir "init.elc")
                       :ok-if-already-exists)
          (setq tangle-init-org-file--first-time nil)
          ;; Keep the init file for debug purposes.
          (if debug-on-error
              tangled
            (delete-file tangled)
            nil))))

    (defun tangle-init-org-file-after-save ()
      (add-hook 'after-save-hook #'tangle-init-org-file nil t))
    ;; It's a bit ugly but it does the job
    (setq safe-local-variable-values '((eval tangle-init-org-file-after-save)))
  #+END_SRC

  It should only be run once, at the first startup, as the real config
  will get generated, byte-compiled and loaded.

  To ensure modifications in this file update the configuration,
  =tangle-init-org-file= is added to the =after-save-hook= as a local
  variable of this file so that changes apply immediatly.

  #+BEGIN_SRC emacs-lisp :tangle "init.el" :noweb tangle
    <<init>>

    (when (and (not after-init-time) ; avoid recursive tangle
               tangle-init-org-file--first-time)
      (tangle-init-org-file))
  #+END_SRC

* General configuration

** cl-lib

   Import =cl-lib= at compile time.

   #+BEGIN_SRC emacs-lisp
    (eval-when-compile
      (require 'cl-lib))
   #+END_SRC

** Garbage collector

   Add a macro to inhibit GC.

   #+BEGIN_SRC emacs-lisp
     (defmacro inhibit-gc (&rest body)
       "Inhibit gc around BODY by setting `gc-cons-threshold' to
     `most-positive-fixnum'.

     \(fn BODY...)"
       (declare (indent 0)
                (debug t))
       `(let ((gc-cons-threshold most-positive-fixnum))
          ,@body))
   #+END_SRC

** Setup defaults

   Setup some default values.

   #+BEGIN_SRC emacs-lisp
     (setq echo-keystrokes 0.1
           bidi-display-reordering nil
           require-final-newline t
           ring-bell-function #'ignore
           require-final-newline t
           truncate-lines t
           scroll-step 1
           scroll-conservatively 10000
           auto-window-vscroll nil
           inhibit-default-init t
           inhibit-startup-screen t
           fill-column 80
           confirm-nonexistent-file-or-buffer nil)
   #+END_SRC

   Make custom file temporary.

   #+BEGIN_SRC emacs-lisp
     (setq custom-file (make-temp-file "custom" nil ".el"))
   #+END_SRC

   Put all auto saves in the same location.

   #+BEGIN_SRC emacs-lisp
     (setq backup-directory-alist `((".*" . ,temporary-file-directory))
           auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
   #+END_SRC

   Change yes/no to y/n.

   #+BEGIN_SRC emacs-lisp
     (fset #'yes-or-no-p #'y-or-n-p)
   #+END_SRC

   Disable VC as i use Git through Magit exclusively.

   #+BEGIN_SRC emacs-lisp
     (setq vc-handled-backends nil)

     (defmacro use-package-with-vc (name &rest args)
       "use-package with temporary VC support."
       (declare (indent defun))
       `(let ((vc-handled-backends '(RCS CVS SVN SCCS SRC Bzr Git Hg)))
          (use-package ,name ,@args)))
   #+END_SRC

** TODO Stuff I should move to different files

   #+BEGIN_SRC emacs-lisp
     (defun disable-tabs ()
       "Disable tabs for indentation."
       (setq indent-tabs-mode nil))
   #+END_SRC

** Setup use-package

   Automatically install =use-package= if it's not installed.

   #+BEGIN_SRC emacs-lisp
     (require 'package)

     (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t)
     (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))

     (require 'use-package)

     (use-package use-package
       :ensure nil ; useless, just here to be consistent
       :custom (use-package-always-ensure t))
   #+END_SRC

** GCMH

   #+BEGIN_SRC emacs-lisp
     (use-package gcmh
       :hook
       (after-init . gcmh-mode))
   #+END_SRC

** esup

   Esup is a great package for profiling the init.
   Setup Esup to profile the byte-compiled version of the init.

   #+BEGIN_SRC emacs-lisp
     (use-package esup
       :init
       (defun esup-tangled ()
         "Profile ~/.emacs.d/init.elc.
     See `esup'"
         (interactive)
         (esup (tangle-init-org-file :no-compile))))
   #+END_SRC

** Theme and modeline

   Some themes have trouble when Emacs was run as a daemon. Create a
   one-time hook called *after-first-make-frame-hook* that is ran only
   once during the *after-make-frame-functions* hook.

   #+BEGIN_SRC emacs-lisp
     (defvar after-first-make-frame-hook nil
       "Functions to run after the first frame is created.
     If Emacs was started as a daemon, uses `after-make-frame-functions',
     else uses `after-init-hook'.")

     (defun run-after-first-make-frame-hooks ()
       "Run hooks in `after-first-make-frame-hook'."
       (if (daemonp)
           (cl-labels ((my--run-once (&optional frame)
                         (with-selected-frame (or frame (selected-frame))
                           (run-hooks 'after-first-make-frame-hook))
                         (remove-hook 'after-make-frame-functions #'my--run-once)))
             (add-hook 'after-make-frame-functions #'my--run-once))
         ;; not a daemon, run hooks in the `after-init-hook'
         (run-hooks 'after-first-make-frame-hook)))

     (add-hook 'after-init-hook #'run-after-first-make-frame-hooks)
   #+END_SRC

   Inspired by Doom Emacs, introduce a variable *my--theme* that is
   used to determine the default theme at startup.

   #+BEGIN_SRC emacs-lisp
     (defvar my--theme nil
       "Theme selected in the configuration.")

     (defun my--load-theme (&optional frame)
       "Load theme configured in `my--theme'.in FRAME."
       (if my--theme
           ;; don't load `my--theme' if it's already loaded
           (when (not (memq my--theme custom-enabled-themes))
             (with-selected-frame (or frame (selected-frame))
               (load-theme my--theme :no-confirm)))
         (error "`my-theme' shouldn't be nil")))

     (add-hook 'after-first-make-frame-hook #'my--load-theme)

     (defun my--reload-theme ()
       "Reload `my--theme'."
       (interactive)
       (my--load-theme))
   #+END_SRC

   Also inspired by Doom Emacs, add a hook on *load-theme* and ensure
   themes are loaded without any cluttering from previous themes.

   #+BEGIN_SRC emacs-lisp
     (defvar my--load-theme-hook nil
       "Hooks to run after `load-theme'.")

     (defun load-theme--after (theme &optional _ no-enable)
       "When `load-theme' is called, disable previous themes and run
     `my-load-theme-hook'."
       (unless no-enable
         (setq my--theme theme)
         (mapc #'disable-theme (remq theme custom-enabled-themes))
         (run-hooks 'my--load-theme-hook)))

     (advice-add 'load-theme :after #'load-theme--after)
   #+END_SRC

   Setup theme.

   #+BEGIN_SRC emacs-lisp
     (use-package doom-themes
       :init
       (setq my--theme 'doom-challenger-deep))
   #+END_SRC

   Setup modeline.

   #+BEGIN_SRC emacs-lisp
     (use-package doom-modeline
       :config
       (defun enable-doom-modeline-icons ()
         (setq doom-modeline-icon t))
       (defun set-doom-modeline-height ()
         (setq doom-modeline-height (* 2 (doom-modeline--font-height))))
       :hook ((after-first-make-frame . doom-modeline-mode)
              (after-first-make-frame . enable-doom-modeline-icons)
              (after-first-make-frame . set-doom-modeline-height)
              (after-first-make-frame . column-number-mode)))
   #+END_SRC

   Setup solaire-mode.

   #+BEGIN_SRC emacs-lisp
     (use-package solaire-mode
       :when (or (daemonp) (display-graphic-p))
       :hook (after-first-make-frame . solaire-global-mode))
   #+END_SRC

